# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# alternate versions: https://github.com/Homebrew/homebrew-cask-versions/tree/master/Casks
# using for 1password6
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
# https://github.com/sharkdp/bat
brew 'bat'
# Update core file and path utilities
brew 'coreutils'
brew 'git'
# https://httpie.org/
brew 'httpie'
# https://github.com/lra/mackup
brew 'mackup'
# Mac App Store manager
# https://github.com/mas-cli/mas
brew 'mas' 
# Required for other packages
brew 'pkg-config'

# List directories in a tree structure
# http://mama.indstate.edu/users/ice/tree/
brew 'tree' 

 # Needed for Memcached
brew 'zlib'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql@5.7'
brew services start mysql@5.7
brew 'wp-cli'


# Apps
# cask '1password'
cask '1password6'
# https://github.com/JohnCoates/Aerial - screensaver
cask 'aerial'
cask 'alfred'
cask 'autodesk-fusion360'
cask 'backblaze'
# https://eatbiscuit.com/ - separate personal and business browser tabs
# cask 'biscuit'
# https://github.com/andrewn/brew-services-menubar - see running brew tasks
cask 'brewservicesmenubar'
# http://lightheadsw.com/caffeine/ - prevent machine from going to sleep
cask 'caffeine'
# https://celestia.space/ - 3D space simulation
# cask 'celestia'
# https://cncnet.org/ - classic Command and Conquer
# cask 'cncnet'
# https://contrasteapp.com/ - accessibility contrast checker
cask 'contraste'
cask 'dash'
# https://www.stclairsoft.com/DefaultFolderX/
# cask 'default-folder-x'

cask 'discord'
cask 'divvy'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'figma'
# https://fontba.se/
cask 'fontbase'
# https://git-fork.com
# cask 'fork'
# https://freezeapp.net
# cask 'freeze'
# https://tynsoe.org/v2/geektool
# cask 'geektool'
cask 'google-chrome'
# https://github.com/zenangst/Gray
# cask 'gray'
# https://hackermenu.io - Hacker News in menu bar
# cask 'hacker-menu'
# cask 'handbrake'
# https://www.haptictouchbar.com/
# cask 'haptic-touch-bar'
# https://www.noodlesoft.com/
# cask 'hazel'
# https://github.com/dwarvesf/hidden/ - hide menu bar icons
# cask 'hiddenbar'
# https://hocusfoc.us/ - hides inactive windows
# cask 'hocus-focus'
cask 'imageoptim'
# https://insomnia.rest/ - REST client
cask 'insomnia'
cask 'iterm2'
cask 'kap'
# https://klokki.com
# cask 'klokki'
# https://laverna.cc # notes
# cask 'laverna'
# https://linear.theuxshop.com/ - ruler
# cask 'linear'
# https://localbyflywheel.com/pro/?autoplay
# cask 'local'
# https://www.luna-lang.org/
# cask 'lunastudio'
# https://mailplaneapp.com
# cask 'mailplane'
# https://github.com/HarshilShah/Nocturnal - toggle dark mode
# cask 'nocturnal'
# https://github.com/notable/notable - promising note app
cask 'notable'
# https://numi.app/ - natural language calculator
cask 'numi' 
cask 'obs'
# https://fireball.studio/oneswitch - menubar toggle of useful switches
# cask 'one-switch'
cask 'opera'
# https://cocoatech.com/#/
# cask 'path-finder'
# https://getpixelsnap.com/ - ruler tool
cask 'pixelsnap'
cask 'prusaslicer'
# https://recentsapp.com/ - recent file launcher
# cask 'recents'
# https://github.com/rxhanson/Rectangle - window resizer
# cask 'rectangle'
# https://runwayml.com/ - machine learning for creators
# cask 'runway'

cask 'sequel-pro'
# https://sizzy.co/ - Responsive window manager (expensive)
# cask 'sizzy'
cask 'sketch'
cask 'slack'
# https://github.com/jigish/slate - extremely configurable window manager
# cask 'slate'
cask 'spotify'
cask 'steam'
# cask 'superduper'

cask 'the-unarchiver'
cask 'tower'
cask 'transmit'
# https://tuple.app/ - expensive pair programming app
# cask 'tuple'
cask 'ultimaker-cura'

cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'visual-studio-code'
cask 'vlc'
cask 'winds' # RSS reader



# Quicklook
# Preview source code files with syntax highlighting
cask 'qlcolorcode'
# Markdown files
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
# Preview plain text without an extension
cask 'qlstephen'
# Shows image info, along with unsupported files like WebP
cask 'qlimagesize'
cask 'qlvideo'


# Fonts
cask 'font-alegreya'
cask 'font-alegreya-sans'
cask 'font-barlow'
cask 'font-dejavu-sans'
cask 'font-lato'
cask 'font-montserrat'
cask 'font-muli'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-sudo'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'